import React from "react";

function About() {
  return (
    <div>
      <h1>Про застосунок</h1>
      <p>
        Цей застосунок є простим Todo-листом, розробленим для демонстрації
        ключових концепцій React, таких як роутінг, керування станом та робота з
        API.
      </p>
      <h2>Використані технології:</h2>
      <ul>
        <li>React — бібліотека для створення користувацьких інтерфейсів.</li>
        <li>React Router DOM — для керування маршрутами в додатку.</li>
        <li>Axios — для виконання HTTP-запитів до API.</li>
        <li>Tailwind CSS — для швидкої та адаптивної стилізації.</li>
      </ul>
      <h2>Про автора</h2>
      <p>
        Я - розробник, який завжди прагне вивчати нові технології та створювати
        функціональні та естетичні вебдодатки.
      </p>
    </div>
  );
}

export default About;
